<?php
mb_internal_encoding("UTF-8");
	 error_reporting(E_ALL);
 ini_set("display_errors", 1);

require_once('transliterate.php');
	
	$sample = 	'།དམིགས་མེད་བརྩེ་བའི་གཏེར་ཆེན་སྤྱན་རས་གཟིགས།
						།དྲི་མེད་མཁྱེན་པའི་དབང་པོ་འཇམ་དཔལ་དབྱངས།
						།བདུད་དཔུང་མ་ལུས་འཇོམས་མཛད་གསང་བའི་བདག།
						།གངས་ཅན་མཁས་པའི་གཙུག་རྒྱན་ཙོང་ཁ་པ།
						།བློ་བཟང་གྲགས་པའི་ཞབས་ལ་གསོལ་བ་འདེབས། ';
						
		$sample .= 'ཨོཾ་བཛྲ་སཏྭ་ས་མ་ཡ་མ་ནུ་པ་ལ་ཡ། བཛྲ་སཏྭ་ཏྭེ་ནོ་པ་ཏིཥྛ། དྲྀ་ཌྷོ་མེ་བྷ་བ། སུ་ཏོ་ ཥྱོ་མེ་བྷ་བ། སུ་པོ་ ཥྱོ་མེ་བྷ་བ། ཨ་ནུ་ར་ཀྟོ་མེ་བྷ་བ། ས་རྦ་སི་དྡྷི་མེ་པྲ་ཡ་ཙྪ། ས་རྦ་ཀ་རྨ་སུ་ཙ་མེ ཙི་ཏྟཾ་ཤེ་ཡཿ་ཀུ་རུ་ཧཱུཾ། ཧ་ཧ་ཧ་ཧ་ཧོཿ བྷ་ག་བ་ན ས་རྦ ཏ་ཐཱ་ག་ཏ་བཛྲ་མཱ་མེ་མུ་ཉྩ། བཛྲཱི་བྷ་བ་མ་ཧཱ་ས་མ་ཡ་སཏྭ ཨཱཿ ཧཱུཾ་ཕཊ།';
	
	//echo $sample;
	
	transliterate($sample, 'ACIP');
	
?>